# window management
tap "felixkratz/formulae" # jankyborders
tap "nikitabobko/tap" # aerospace

brew "felixkratz/formulae/borders"
cask "aerospace"

# CLI tools
brew "bat"
brew "btop"
brew "docker"
brew "eza"
brew "fd"
brew "fzf"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "yazi"
brew "zoxide"

# terminal emulators
cask "wezterm" 
cask "ghostty"

# other
cask "hiddenbar" # QoL tool to minimize toolbar clutter
cask "karabiner-elements" # key remapper and hotkey tool

# fonts
cask "font-victor-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
